Documents/Поездка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>Поездка</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БалансВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачальныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонечныйПункт</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтоимостьПоездки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Деньги</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвободныеМеста</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пассажиры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пассажир</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОценкаВодителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОценкаВодителя</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РейтингВодителей</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поездка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поездка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пассажир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОценкаПассажира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОценкаПассажира</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.РейтингПассажиров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поездка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поездка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пассажир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Оценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/Поездка/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
		Объект.Водитель = ПолучитьИмяВодителя();
	КонецЕсли;
	ЭтаФорма.Элементы.НезавершеннаяПоездка.ТолькоПросмотр 
		= Объект.Завершена ИЛИ ПользовательЯвляетсяПассажиром() ИЛИ НЕ ЭтоСвояПоездка();
КонецПроцедуры 
	
&НаСервере
Функция ПользовательЯвляетсяПассажиром() 
	Возврат РольДоступна("Пассажир");	
КонецФункции

&НаСервере
Функция ЭтоСвояПоездка()
	Если НЕ ЗначениеЗаполнено(Объект.Водитель) Тогда
		Возврат Истина;
	Иначе
		Возврат ПолучитьИмяВодителя() = Объект.Водитель;
	КонецЕсли;	
КонецФункции


&НаСервереБезКонтекста
Функция ПолучитьИмяВодителя()
	Возврат ПользователиИнформационнойБазы.ТекущийПользователь().Имя;	
КонецФункции

&НаКлиенте
Процедура ЗавершитьПоездку(Команда) 
	Объект.Завершена = Истина;  
	ОценитьВодителя();
	ОценитьПассажиров(); 
	ЭтаФорма.Записать();
	ЭтаФорма.Закрыть();
КонецПроцедуры   	
	
&НаСервере
Процедура ОценитьВодителя()  
	Для каждого ТекПассажир из Объект.Пассажиры Цикл    
		ОценкаВодителю = Документы.ОценкаВодителя.СоздатьДокумент();  
		ОценкаВодителю.Дата = ТекущаяДата();   
		ОценкаВодителю.Водитель = Объект.Водитель;
		ОценкаВодителю.Пассажир = ТекПассажир.Пассажир;    
		ОценкаВодителю.Поездка = Объект.Ссылка;
		ОценкаВодителю.Записать();	
	КонецЦикла;
КонецПроцедуры           

Процедура ОценитьПассажиров() 
	Для каждого ТекПассажир из Объект.Пассажиры Цикл    
		ОценкаПассажиру = Документы.ОценкаПассажира.СоздатьДокумент();  
		ОценкаПассажиру.Дата = ТекущаяДата();   
		ОценкаПассажиру.Водитель = Объект.Водитель;
		ОценкаПассажиру.Пассажир = ТекПассажир.Пассажир;    
		ОценкаПассажиру.Поездка = Объект.Ссылка;
		ОценкаПассажиру.Записать();	
	КонецЦикла;
КонецПроцедуры
